app/controllers/items_controller.rb

    def expensive
      @items = Item.where("price > 500")
---
SELECT "items".* FROM "items" WHERE (price > 500)

    def create
        @item = Item.create(item_params)
---
INSERT INTO "items" ("price", "name", "weight", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["price", 10000000000.0], ["name", "ferarry"], ["weight", 800.0], ["description", "sport_car"], ["created_at", "2020-05-13 10:47:00.420032"], ["updated_at", "2020-05-13 10:47:00.420032"]]

    def update
      #@item = Item.find(params[:id])
      @item.update_attributes(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "test variant!!!!!!!!!!!!!!!!!!!1"], ["updated_at", "2020-05-13 10:46:31.039533"], ["id", 9]]

    def destroy
      #@item = Item.destroy(params[:id])
      @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 9]]

    def upvote
      @item.increment!(:votes_count)
---
UPDATE "items" SET "votes_count" = COALESCE("votes_count", 0) + ? WHERE "items"."id" = ?  [["votes_count", 1], ["id", 12]]

    def find_item
      @item = Item.where(id: params[:id]).first
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", nil], ["LIMIT", 1]]